----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 56, 128, 128]           1,512
       BatchNorm2d-2         [-1, 56, 128, 128]             112
              SiLU-3         [-1, 56, 128, 128]               0
            Conv2d-4         [-1, 56, 128, 128]             504
       BatchNorm2d-5         [-1, 56, 128, 128]             112
              SiLU-6         [-1, 56, 128, 128]               0
 AdaptiveAvgPool2d-7             [-1, 56, 1, 1]               0
            Conv2d-8             [-1, 14, 1, 1]             798
              SiLU-9             [-1, 14, 1, 1]               0
           Conv2d-10             [-1, 56, 1, 1]             840
          Sigmoid-11             [-1, 56, 1, 1]               0
SqueezeExcitation-12         [-1, 56, 128, 128]               0
           Conv2d-13         [-1, 32, 128, 128]           1,792
      BatchNorm2d-14         [-1, 32, 128, 128]              64
           MBConv-15         [-1, 32, 128, 128]               0
           Conv2d-16         [-1, 32, 128, 128]             288
      BatchNorm2d-17         [-1, 32, 128, 128]              64
             SiLU-18         [-1, 32, 128, 128]               0
AdaptiveAvgPool2d-19             [-1, 32, 1, 1]               0
           Conv2d-20              [-1, 8, 1, 1]             264
             SiLU-21              [-1, 8, 1, 1]               0
           Conv2d-22             [-1, 32, 1, 1]             288
          Sigmoid-23             [-1, 32, 1, 1]               0
SqueezeExcitation-24         [-1, 32, 128, 128]               0
           Conv2d-25         [-1, 32, 128, 128]           1,024
      BatchNorm2d-26         [-1, 32, 128, 128]              64
  StochasticDepth-27         [-1, 32, 128, 128]               0
           MBConv-28         [-1, 32, 128, 128]               0
           Conv2d-29         [-1, 32, 128, 128]             288
      BatchNorm2d-30         [-1, 32, 128, 128]              64
             SiLU-31         [-1, 32, 128, 128]               0
AdaptiveAvgPool2d-32             [-1, 32, 1, 1]               0
           Conv2d-33              [-1, 8, 1, 1]             264
             SiLU-34              [-1, 8, 1, 1]               0
           Conv2d-35             [-1, 32, 1, 1]             288
          Sigmoid-36             [-1, 32, 1, 1]               0
SqueezeExcitation-37         [-1, 32, 128, 128]               0
           Conv2d-38         [-1, 32, 128, 128]           1,024
      BatchNorm2d-39         [-1, 32, 128, 128]              64
  StochasticDepth-40         [-1, 32, 128, 128]               0
           MBConv-41         [-1, 32, 128, 128]               0
           Conv2d-42        [-1, 192, 128, 128]           6,144
      BatchNorm2d-43        [-1, 192, 128, 128]             384
             SiLU-44        [-1, 192, 128, 128]               0
           Conv2d-45          [-1, 192, 64, 64]           1,728
      BatchNorm2d-46          [-1, 192, 64, 64]             384
             SiLU-47          [-1, 192, 64, 64]               0
AdaptiveAvgPool2d-48            [-1, 192, 1, 1]               0
           Conv2d-49              [-1, 8, 1, 1]           1,544
             SiLU-50              [-1, 8, 1, 1]               0
           Conv2d-51            [-1, 192, 1, 1]           1,728
          Sigmoid-52            [-1, 192, 1, 1]               0
SqueezeExcitation-53          [-1, 192, 64, 64]               0
           Conv2d-54           [-1, 40, 64, 64]           7,680
      BatchNorm2d-55           [-1, 40, 64, 64]              80
           MBConv-56           [-1, 40, 64, 64]               0
           Conv2d-57          [-1, 240, 64, 64]           9,600
      BatchNorm2d-58          [-1, 240, 64, 64]             480
             SiLU-59          [-1, 240, 64, 64]               0
           Conv2d-60          [-1, 240, 64, 64]           2,160
      BatchNorm2d-61          [-1, 240, 64, 64]             480
             SiLU-62          [-1, 240, 64, 64]               0
AdaptiveAvgPool2d-63            [-1, 240, 1, 1]               0
           Conv2d-64             [-1, 10, 1, 1]           2,410
             SiLU-65             [-1, 10, 1, 1]               0
           Conv2d-66            [-1, 240, 1, 1]           2,640
          Sigmoid-67            [-1, 240, 1, 1]               0
SqueezeExcitation-68          [-1, 240, 64, 64]               0
           Conv2d-69           [-1, 40, 64, 64]           9,600
      BatchNorm2d-70           [-1, 40, 64, 64]              80
  StochasticDepth-71           [-1, 40, 64, 64]               0
           MBConv-72           [-1, 40, 64, 64]               0
           Conv2d-73          [-1, 240, 64, 64]           9,600
      BatchNorm2d-74          [-1, 240, 64, 64]             480
             SiLU-75          [-1, 240, 64, 64]               0
           Conv2d-76          [-1, 240, 64, 64]           2,160
      BatchNorm2d-77          [-1, 240, 64, 64]             480
             SiLU-78          [-1, 240, 64, 64]               0
AdaptiveAvgPool2d-79            [-1, 240, 1, 1]               0
           Conv2d-80             [-1, 10, 1, 1]           2,410
             SiLU-81             [-1, 10, 1, 1]               0
           Conv2d-82            [-1, 240, 1, 1]           2,640
          Sigmoid-83            [-1, 240, 1, 1]               0
SqueezeExcitation-84          [-1, 240, 64, 64]               0
           Conv2d-85           [-1, 40, 64, 64]           9,600
      BatchNorm2d-86           [-1, 40, 64, 64]              80
  StochasticDepth-87           [-1, 40, 64, 64]               0
           MBConv-88           [-1, 40, 64, 64]               0
           Conv2d-89          [-1, 240, 64, 64]           9,600
      BatchNorm2d-90          [-1, 240, 64, 64]             480
             SiLU-91          [-1, 240, 64, 64]               0
           Conv2d-92          [-1, 240, 64, 64]           2,160
      BatchNorm2d-93          [-1, 240, 64, 64]             480
             SiLU-94          [-1, 240, 64, 64]               0
AdaptiveAvgPool2d-95            [-1, 240, 1, 1]               0
           Conv2d-96             [-1, 10, 1, 1]           2,410
             SiLU-97             [-1, 10, 1, 1]               0
           Conv2d-98            [-1, 240, 1, 1]           2,640
          Sigmoid-99            [-1, 240, 1, 1]               0
SqueezeExcitation-100          [-1, 240, 64, 64]               0
          Conv2d-101           [-1, 40, 64, 64]           9,600
     BatchNorm2d-102           [-1, 40, 64, 64]              80
 StochasticDepth-103           [-1, 40, 64, 64]               0
          MBConv-104           [-1, 40, 64, 64]               0
          Conv2d-105          [-1, 240, 64, 64]           9,600
     BatchNorm2d-106          [-1, 240, 64, 64]             480
            SiLU-107          [-1, 240, 64, 64]               0
          Conv2d-108          [-1, 240, 64, 64]           2,160
     BatchNorm2d-109          [-1, 240, 64, 64]             480
            SiLU-110          [-1, 240, 64, 64]               0
AdaptiveAvgPool2d-111            [-1, 240, 1, 1]               0
          Conv2d-112             [-1, 10, 1, 1]           2,410
            SiLU-113             [-1, 10, 1, 1]               0
          Conv2d-114            [-1, 240, 1, 1]           2,640
         Sigmoid-115            [-1, 240, 1, 1]               0
SqueezeExcitation-116          [-1, 240, 64, 64]               0
          Conv2d-117           [-1, 40, 64, 64]           9,600
     BatchNorm2d-118           [-1, 40, 64, 64]              80
 StochasticDepth-119           [-1, 40, 64, 64]               0
          MBConv-120           [-1, 40, 64, 64]               0
          Conv2d-121          [-1, 240, 64, 64]           9,600
     BatchNorm2d-122          [-1, 240, 64, 64]             480
            SiLU-123          [-1, 240, 64, 64]               0
          Conv2d-124          [-1, 240, 64, 64]           2,160
     BatchNorm2d-125          [-1, 240, 64, 64]             480
            SiLU-126          [-1, 240, 64, 64]               0
AdaptiveAvgPool2d-127            [-1, 240, 1, 1]               0
          Conv2d-128             [-1, 10, 1, 1]           2,410
            SiLU-129             [-1, 10, 1, 1]               0
          Conv2d-130            [-1, 240, 1, 1]           2,640
         Sigmoid-131            [-1, 240, 1, 1]               0
SqueezeExcitation-132          [-1, 240, 64, 64]               0
          Conv2d-133           [-1, 40, 64, 64]           9,600
     BatchNorm2d-134           [-1, 40, 64, 64]              80
 StochasticDepth-135           [-1, 40, 64, 64]               0
          MBConv-136           [-1, 40, 64, 64]               0
          Conv2d-137          [-1, 240, 64, 64]           9,600
     BatchNorm2d-138          [-1, 240, 64, 64]             480
            SiLU-139          [-1, 240, 64, 64]               0
          Conv2d-140          [-1, 240, 32, 32]           6,000
     BatchNorm2d-141          [-1, 240, 32, 32]             480
            SiLU-142          [-1, 240, 32, 32]               0
AdaptiveAvgPool2d-143            [-1, 240, 1, 1]               0
          Conv2d-144             [-1, 10, 1, 1]           2,410
            SiLU-145             [-1, 10, 1, 1]               0
          Conv2d-146            [-1, 240, 1, 1]           2,640
         Sigmoid-147            [-1, 240, 1, 1]               0
SqueezeExcitation-148          [-1, 240, 32, 32]               0
          Conv2d-149           [-1, 72, 32, 32]          17,280
     BatchNorm2d-150           [-1, 72, 32, 32]             144
          MBConv-151           [-1, 72, 32, 32]               0
          Conv2d-152          [-1, 432, 32, 32]          31,104
     BatchNorm2d-153          [-1, 432, 32, 32]             864
            SiLU-154          [-1, 432, 32, 32]               0
          Conv2d-155          [-1, 432, 32, 32]          10,800
     BatchNorm2d-156          [-1, 432, 32, 32]             864
            SiLU-157          [-1, 432, 32, 32]               0
AdaptiveAvgPool2d-158            [-1, 432, 1, 1]               0
          Conv2d-159             [-1, 18, 1, 1]           7,794
            SiLU-160             [-1, 18, 1, 1]               0
          Conv2d-161            [-1, 432, 1, 1]           8,208
         Sigmoid-162            [-1, 432, 1, 1]               0
SqueezeExcitation-163          [-1, 432, 32, 32]               0
          Conv2d-164           [-1, 72, 32, 32]          31,104
     BatchNorm2d-165           [-1, 72, 32, 32]             144
 StochasticDepth-166           [-1, 72, 32, 32]               0
          MBConv-167           [-1, 72, 32, 32]               0
          Conv2d-168          [-1, 432, 32, 32]          31,104
     BatchNorm2d-169          [-1, 432, 32, 32]             864
            SiLU-170          [-1, 432, 32, 32]               0
          Conv2d-171          [-1, 432, 32, 32]          10,800
     BatchNorm2d-172          [-1, 432, 32, 32]             864
            SiLU-173          [-1, 432, 32, 32]               0
AdaptiveAvgPool2d-174            [-1, 432, 1, 1]               0
          Conv2d-175             [-1, 18, 1, 1]           7,794
            SiLU-176             [-1, 18, 1, 1]               0
          Conv2d-177            [-1, 432, 1, 1]           8,208
         Sigmoid-178            [-1, 432, 1, 1]               0
SqueezeExcitation-179          [-1, 432, 32, 32]               0
          Conv2d-180           [-1, 72, 32, 32]          31,104
     BatchNorm2d-181           [-1, 72, 32, 32]             144
 StochasticDepth-182           [-1, 72, 32, 32]               0
          MBConv-183           [-1, 72, 32, 32]               0
          Conv2d-184          [-1, 432, 32, 32]          31,104
     BatchNorm2d-185          [-1, 432, 32, 32]             864
            SiLU-186          [-1, 432, 32, 32]               0
          Conv2d-187          [-1, 432, 32, 32]          10,800
     BatchNorm2d-188          [-1, 432, 32, 32]             864
            SiLU-189          [-1, 432, 32, 32]               0
AdaptiveAvgPool2d-190            [-1, 432, 1, 1]               0
          Conv2d-191             [-1, 18, 1, 1]           7,794
            SiLU-192             [-1, 18, 1, 1]               0
          Conv2d-193            [-1, 432, 1, 1]           8,208
         Sigmoid-194            [-1, 432, 1, 1]               0
SqueezeExcitation-195          [-1, 432, 32, 32]               0
          Conv2d-196           [-1, 72, 32, 32]          31,104
     BatchNorm2d-197           [-1, 72, 32, 32]             144
 StochasticDepth-198           [-1, 72, 32, 32]               0
          MBConv-199           [-1, 72, 32, 32]               0
          Conv2d-200          [-1, 432, 32, 32]          31,104
     BatchNorm2d-201          [-1, 432, 32, 32]             864
            SiLU-202          [-1, 432, 32, 32]               0
          Conv2d-203          [-1, 432, 32, 32]          10,800
     BatchNorm2d-204          [-1, 432, 32, 32]             864
            SiLU-205          [-1, 432, 32, 32]               0
AdaptiveAvgPool2d-206            [-1, 432, 1, 1]               0
          Conv2d-207             [-1, 18, 1, 1]           7,794
            SiLU-208             [-1, 18, 1, 1]               0
          Conv2d-209            [-1, 432, 1, 1]           8,208
         Sigmoid-210            [-1, 432, 1, 1]               0
SqueezeExcitation-211          [-1, 432, 32, 32]               0
          Conv2d-212           [-1, 72, 32, 32]          31,104
     BatchNorm2d-213           [-1, 72, 32, 32]             144
 StochasticDepth-214           [-1, 72, 32, 32]               0
          MBConv-215           [-1, 72, 32, 32]               0
          Conv2d-216          [-1, 432, 32, 32]          31,104
     BatchNorm2d-217          [-1, 432, 32, 32]             864
            SiLU-218          [-1, 432, 32, 32]               0
          Conv2d-219          [-1, 432, 32, 32]          10,800
     BatchNorm2d-220          [-1, 432, 32, 32]             864
            SiLU-221          [-1, 432, 32, 32]               0
AdaptiveAvgPool2d-222            [-1, 432, 1, 1]               0
          Conv2d-223             [-1, 18, 1, 1]           7,794
            SiLU-224             [-1, 18, 1, 1]               0
          Conv2d-225            [-1, 432, 1, 1]           8,208
         Sigmoid-226            [-1, 432, 1, 1]               0
SqueezeExcitation-227          [-1, 432, 32, 32]               0
          Conv2d-228           [-1, 72, 32, 32]          31,104
     BatchNorm2d-229           [-1, 72, 32, 32]             144
 StochasticDepth-230           [-1, 72, 32, 32]               0
          MBConv-231           [-1, 72, 32, 32]               0
          Conv2d-232          [-1, 432, 32, 32]          31,104
     BatchNorm2d-233          [-1, 432, 32, 32]             864
            SiLU-234          [-1, 432, 32, 32]               0
          Conv2d-235          [-1, 432, 16, 16]           3,888
     BatchNorm2d-236          [-1, 432, 16, 16]             864
            SiLU-237          [-1, 432, 16, 16]               0
AdaptiveAvgPool2d-238            [-1, 432, 1, 1]               0
          Conv2d-239             [-1, 18, 1, 1]           7,794
            SiLU-240             [-1, 18, 1, 1]               0
          Conv2d-241            [-1, 432, 1, 1]           8,208
         Sigmoid-242            [-1, 432, 1, 1]               0
SqueezeExcitation-243          [-1, 432, 16, 16]               0
          Conv2d-244          [-1, 144, 16, 16]          62,208
     BatchNorm2d-245          [-1, 144, 16, 16]             288
          MBConv-246          [-1, 144, 16, 16]               0
          Conv2d-247          [-1, 864, 16, 16]         124,416
     BatchNorm2d-248          [-1, 864, 16, 16]           1,728
            SiLU-249          [-1, 864, 16, 16]               0
          Conv2d-250          [-1, 864, 16, 16]           7,776
     BatchNorm2d-251          [-1, 864, 16, 16]           1,728
            SiLU-252          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-253            [-1, 864, 1, 1]               0
          Conv2d-254             [-1, 36, 1, 1]          31,140
            SiLU-255             [-1, 36, 1, 1]               0
          Conv2d-256            [-1, 864, 1, 1]          31,968
         Sigmoid-257            [-1, 864, 1, 1]               0
SqueezeExcitation-258          [-1, 864, 16, 16]               0
          Conv2d-259          [-1, 144, 16, 16]         124,416
     BatchNorm2d-260          [-1, 144, 16, 16]             288
 StochasticDepth-261          [-1, 144, 16, 16]               0
          MBConv-262          [-1, 144, 16, 16]               0
          Conv2d-263          [-1, 864, 16, 16]         124,416
     BatchNorm2d-264          [-1, 864, 16, 16]           1,728
            SiLU-265          [-1, 864, 16, 16]               0
          Conv2d-266          [-1, 864, 16, 16]           7,776
     BatchNorm2d-267          [-1, 864, 16, 16]           1,728
            SiLU-268          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-269            [-1, 864, 1, 1]               0
          Conv2d-270             [-1, 36, 1, 1]          31,140
            SiLU-271             [-1, 36, 1, 1]               0
          Conv2d-272            [-1, 864, 1, 1]          31,968
         Sigmoid-273            [-1, 864, 1, 1]               0
SqueezeExcitation-274          [-1, 864, 16, 16]               0
          Conv2d-275          [-1, 144, 16, 16]         124,416
     BatchNorm2d-276          [-1, 144, 16, 16]             288
 StochasticDepth-277          [-1, 144, 16, 16]               0
          MBConv-278          [-1, 144, 16, 16]               0
          Conv2d-279          [-1, 864, 16, 16]         124,416
     BatchNorm2d-280          [-1, 864, 16, 16]           1,728
            SiLU-281          [-1, 864, 16, 16]               0
          Conv2d-282          [-1, 864, 16, 16]           7,776
     BatchNorm2d-283          [-1, 864, 16, 16]           1,728
            SiLU-284          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-285            [-1, 864, 1, 1]               0
          Conv2d-286             [-1, 36, 1, 1]          31,140
            SiLU-287             [-1, 36, 1, 1]               0
          Conv2d-288            [-1, 864, 1, 1]          31,968
         Sigmoid-289            [-1, 864, 1, 1]               0
SqueezeExcitation-290          [-1, 864, 16, 16]               0
          Conv2d-291          [-1, 144, 16, 16]         124,416
     BatchNorm2d-292          [-1, 144, 16, 16]             288
 StochasticDepth-293          [-1, 144, 16, 16]               0
          MBConv-294          [-1, 144, 16, 16]               0
          Conv2d-295          [-1, 864, 16, 16]         124,416
     BatchNorm2d-296          [-1, 864, 16, 16]           1,728
            SiLU-297          [-1, 864, 16, 16]               0
          Conv2d-298          [-1, 864, 16, 16]           7,776
     BatchNorm2d-299          [-1, 864, 16, 16]           1,728
            SiLU-300          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-301            [-1, 864, 1, 1]               0
          Conv2d-302             [-1, 36, 1, 1]          31,140
            SiLU-303             [-1, 36, 1, 1]               0
          Conv2d-304            [-1, 864, 1, 1]          31,968
         Sigmoid-305            [-1, 864, 1, 1]               0
SqueezeExcitation-306          [-1, 864, 16, 16]               0
          Conv2d-307          [-1, 144, 16, 16]         124,416
     BatchNorm2d-308          [-1, 144, 16, 16]             288
 StochasticDepth-309          [-1, 144, 16, 16]               0
          MBConv-310          [-1, 144, 16, 16]               0
          Conv2d-311          [-1, 864, 16, 16]         124,416
     BatchNorm2d-312          [-1, 864, 16, 16]           1,728
            SiLU-313          [-1, 864, 16, 16]               0
          Conv2d-314          [-1, 864, 16, 16]           7,776
     BatchNorm2d-315          [-1, 864, 16, 16]           1,728
            SiLU-316          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-317            [-1, 864, 1, 1]               0
          Conv2d-318             [-1, 36, 1, 1]          31,140
            SiLU-319             [-1, 36, 1, 1]               0
          Conv2d-320            [-1, 864, 1, 1]          31,968
         Sigmoid-321            [-1, 864, 1, 1]               0
SqueezeExcitation-322          [-1, 864, 16, 16]               0
          Conv2d-323          [-1, 144, 16, 16]         124,416
     BatchNorm2d-324          [-1, 144, 16, 16]             288
 StochasticDepth-325          [-1, 144, 16, 16]               0
          MBConv-326          [-1, 144, 16, 16]               0
          Conv2d-327          [-1, 864, 16, 16]         124,416
     BatchNorm2d-328          [-1, 864, 16, 16]           1,728
            SiLU-329          [-1, 864, 16, 16]               0
          Conv2d-330          [-1, 864, 16, 16]           7,776
     BatchNorm2d-331          [-1, 864, 16, 16]           1,728
            SiLU-332          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-333            [-1, 864, 1, 1]               0
          Conv2d-334             [-1, 36, 1, 1]          31,140
            SiLU-335             [-1, 36, 1, 1]               0
          Conv2d-336            [-1, 864, 1, 1]          31,968
         Sigmoid-337            [-1, 864, 1, 1]               0
SqueezeExcitation-338          [-1, 864, 16, 16]               0
          Conv2d-339          [-1, 144, 16, 16]         124,416
     BatchNorm2d-340          [-1, 144, 16, 16]             288
 StochasticDepth-341          [-1, 144, 16, 16]               0
          MBConv-342          [-1, 144, 16, 16]               0
          Conv2d-343          [-1, 864, 16, 16]         124,416
     BatchNorm2d-344          [-1, 864, 16, 16]           1,728
            SiLU-345          [-1, 864, 16, 16]               0
          Conv2d-346          [-1, 864, 16, 16]           7,776
     BatchNorm2d-347          [-1, 864, 16, 16]           1,728
            SiLU-348          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-349            [-1, 864, 1, 1]               0
          Conv2d-350             [-1, 36, 1, 1]          31,140
            SiLU-351             [-1, 36, 1, 1]               0
          Conv2d-352            [-1, 864, 1, 1]          31,968
         Sigmoid-353            [-1, 864, 1, 1]               0
SqueezeExcitation-354          [-1, 864, 16, 16]               0
          Conv2d-355          [-1, 144, 16, 16]         124,416
     BatchNorm2d-356          [-1, 144, 16, 16]             288
 StochasticDepth-357          [-1, 144, 16, 16]               0
          MBConv-358          [-1, 144, 16, 16]               0
          Conv2d-359          [-1, 864, 16, 16]         124,416
     BatchNorm2d-360          [-1, 864, 16, 16]           1,728
            SiLU-361          [-1, 864, 16, 16]               0
          Conv2d-362          [-1, 864, 16, 16]          21,600
     BatchNorm2d-363          [-1, 864, 16, 16]           1,728
            SiLU-364          [-1, 864, 16, 16]               0
AdaptiveAvgPool2d-365            [-1, 864, 1, 1]               0
          Conv2d-366             [-1, 36, 1, 1]          31,140
            SiLU-367             [-1, 36, 1, 1]               0
          Conv2d-368            [-1, 864, 1, 1]          31,968
         Sigmoid-369            [-1, 864, 1, 1]               0
SqueezeExcitation-370          [-1, 864, 16, 16]               0
          Conv2d-371          [-1, 200, 16, 16]         172,800
     BatchNorm2d-372          [-1, 200, 16, 16]             400
          MBConv-373          [-1, 200, 16, 16]               0
          Conv2d-374         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-375         [-1, 1200, 16, 16]           2,400
            SiLU-376         [-1, 1200, 16, 16]               0
          Conv2d-377         [-1, 1200, 16, 16]          30,000
     BatchNorm2d-378         [-1, 1200, 16, 16]           2,400
            SiLU-379         [-1, 1200, 16, 16]               0
AdaptiveAvgPool2d-380           [-1, 1200, 1, 1]               0
          Conv2d-381             [-1, 50, 1, 1]          60,050
            SiLU-382             [-1, 50, 1, 1]               0
          Conv2d-383           [-1, 1200, 1, 1]          61,200
         Sigmoid-384           [-1, 1200, 1, 1]               0
SqueezeExcitation-385         [-1, 1200, 16, 16]               0
          Conv2d-386          [-1, 200, 16, 16]         240,000
     BatchNorm2d-387          [-1, 200, 16, 16]             400
 StochasticDepth-388          [-1, 200, 16, 16]               0
          MBConv-389          [-1, 200, 16, 16]               0
          Conv2d-390         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-391         [-1, 1200, 16, 16]           2,400
            SiLU-392         [-1, 1200, 16, 16]               0
          Conv2d-393         [-1, 1200, 16, 16]          30,000
     BatchNorm2d-394         [-1, 1200, 16, 16]           2,400
            SiLU-395         [-1, 1200, 16, 16]               0
AdaptiveAvgPool2d-396           [-1, 1200, 1, 1]               0
          Conv2d-397             [-1, 50, 1, 1]          60,050
            SiLU-398             [-1, 50, 1, 1]               0
          Conv2d-399           [-1, 1200, 1, 1]          61,200
         Sigmoid-400           [-1, 1200, 1, 1]               0
SqueezeExcitation-401         [-1, 1200, 16, 16]               0
          Conv2d-402          [-1, 200, 16, 16]         240,000
     BatchNorm2d-403          [-1, 200, 16, 16]             400
 StochasticDepth-404          [-1, 200, 16, 16]               0
          MBConv-405          [-1, 200, 16, 16]               0
          Conv2d-406         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-407         [-1, 1200, 16, 16]           2,400
            SiLU-408         [-1, 1200, 16, 16]               0
          Conv2d-409         [-1, 1200, 16, 16]          30,000
     BatchNorm2d-410         [-1, 1200, 16, 16]           2,400
            SiLU-411         [-1, 1200, 16, 16]               0
AdaptiveAvgPool2d-412           [-1, 1200, 1, 1]               0
          Conv2d-413             [-1, 50, 1, 1]          60,050
            SiLU-414             [-1, 50, 1, 1]               0
          Conv2d-415           [-1, 1200, 1, 1]          61,200
         Sigmoid-416           [-1, 1200, 1, 1]               0
SqueezeExcitation-417         [-1, 1200, 16, 16]               0
          Conv2d-418          [-1, 200, 16, 16]         240,000
     BatchNorm2d-419          [-1, 200, 16, 16]             400
 StochasticDepth-420          [-1, 200, 16, 16]               0
          MBConv-421          [-1, 200, 16, 16]               0
          Conv2d-422         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-423         [-1, 1200, 16, 16]           2,400
            SiLU-424         [-1, 1200, 16, 16]               0
          Conv2d-425         [-1, 1200, 16, 16]          30,000
     BatchNorm2d-426         [-1, 1200, 16, 16]           2,400
            SiLU-427         [-1, 1200, 16, 16]               0
AdaptiveAvgPool2d-428           [-1, 1200, 1, 1]               0
          Conv2d-429             [-1, 50, 1, 1]          60,050
            SiLU-430             [-1, 50, 1, 1]               0
          Conv2d-431           [-1, 1200, 1, 1]          61,200
         Sigmoid-432           [-1, 1200, 1, 1]               0
SqueezeExcitation-433         [-1, 1200, 16, 16]               0
          Conv2d-434          [-1, 200, 16, 16]         240,000
     BatchNorm2d-435          [-1, 200, 16, 16]             400
 StochasticDepth-436          [-1, 200, 16, 16]               0
          MBConv-437          [-1, 200, 16, 16]               0
          Conv2d-438         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-439         [-1, 1200, 16, 16]           2,400
            SiLU-440         [-1, 1200, 16, 16]               0
          Conv2d-441         [-1, 1200, 16, 16]          30,000
     BatchNorm2d-442         [-1, 1200, 16, 16]           2,400
            SiLU-443         [-1, 1200, 16, 16]               0
AdaptiveAvgPool2d-444           [-1, 1200, 1, 1]               0
          Conv2d-445             [-1, 50, 1, 1]          60,050
            SiLU-446             [-1, 50, 1, 1]               0
          Conv2d-447           [-1, 1200, 1, 1]          61,200
         Sigmoid-448           [-1, 1200, 1, 1]               0
SqueezeExcitation-449         [-1, 1200, 16, 16]               0
          Conv2d-450          [-1, 200, 16, 16]         240,000
     BatchNorm2d-451          [-1, 200, 16, 16]             400
 StochasticDepth-452          [-1, 200, 16, 16]               0
          MBConv-453          [-1, 200, 16, 16]               0
          Conv2d-454         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-455         [-1, 1200, 16, 16]           2,400
            SiLU-456         [-1, 1200, 16, 16]               0
          Conv2d-457         [-1, 1200, 16, 16]          30,000
     BatchNorm2d-458         [-1, 1200, 16, 16]           2,400
            SiLU-459         [-1, 1200, 16, 16]               0
AdaptiveAvgPool2d-460           [-1, 1200, 1, 1]               0
          Conv2d-461             [-1, 50, 1, 1]          60,050
            SiLU-462             [-1, 50, 1, 1]               0
          Conv2d-463           [-1, 1200, 1, 1]          61,200
         Sigmoid-464           [-1, 1200, 1, 1]               0
SqueezeExcitation-465         [-1, 1200, 16, 16]               0
          Conv2d-466          [-1, 200, 16, 16]         240,000
     BatchNorm2d-467          [-1, 200, 16, 16]             400
 StochasticDepth-468          [-1, 200, 16, 16]               0
          MBConv-469          [-1, 200, 16, 16]               0
          Conv2d-470         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-471         [-1, 1200, 16, 16]           2,400
            SiLU-472         [-1, 1200, 16, 16]               0
          Conv2d-473         [-1, 1200, 16, 16]          30,000
     BatchNorm2d-474         [-1, 1200, 16, 16]           2,400
            SiLU-475         [-1, 1200, 16, 16]               0
AdaptiveAvgPool2d-476           [-1, 1200, 1, 1]               0
          Conv2d-477             [-1, 50, 1, 1]          60,050
            SiLU-478             [-1, 50, 1, 1]               0
          Conv2d-479           [-1, 1200, 1, 1]          61,200
         Sigmoid-480           [-1, 1200, 1, 1]               0
SqueezeExcitation-481         [-1, 1200, 16, 16]               0
          Conv2d-482          [-1, 200, 16, 16]         240,000
     BatchNorm2d-483          [-1, 200, 16, 16]             400
 StochasticDepth-484          [-1, 200, 16, 16]               0
          MBConv-485          [-1, 200, 16, 16]               0
          Conv2d-486         [-1, 1200, 16, 16]         240,000
     BatchNorm2d-487         [-1, 1200, 16, 16]           2,400
            SiLU-488         [-1, 1200, 16, 16]               0
          Conv2d-489           [-1, 1200, 8, 8]          30,000
     BatchNorm2d-490           [-1, 1200, 8, 8]           2,400
            SiLU-491           [-1, 1200, 8, 8]               0
AdaptiveAvgPool2d-492           [-1, 1200, 1, 1]               0
          Conv2d-493             [-1, 50, 1, 1]          60,050
            SiLU-494             [-1, 50, 1, 1]               0
          Conv2d-495           [-1, 1200, 1, 1]          61,200
         Sigmoid-496           [-1, 1200, 1, 1]               0
SqueezeExcitation-497           [-1, 1200, 8, 8]               0
          Conv2d-498            [-1, 344, 8, 8]         412,800
     BatchNorm2d-499            [-1, 344, 8, 8]             688
          MBConv-500            [-1, 344, 8, 8]               0
          Conv2d-501           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-502           [-1, 2064, 8, 8]           4,128
            SiLU-503           [-1, 2064, 8, 8]               0
          Conv2d-504           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-505           [-1, 2064, 8, 8]           4,128
            SiLU-506           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-507           [-1, 2064, 1, 1]               0
          Conv2d-508             [-1, 86, 1, 1]         177,590
            SiLU-509             [-1, 86, 1, 1]               0
          Conv2d-510           [-1, 2064, 1, 1]         179,568
         Sigmoid-511           [-1, 2064, 1, 1]               0
SqueezeExcitation-512           [-1, 2064, 8, 8]               0
          Conv2d-513            [-1, 344, 8, 8]         710,016
     BatchNorm2d-514            [-1, 344, 8, 8]             688
 StochasticDepth-515            [-1, 344, 8, 8]               0
          MBConv-516            [-1, 344, 8, 8]               0
          Conv2d-517           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-518           [-1, 2064, 8, 8]           4,128
            SiLU-519           [-1, 2064, 8, 8]               0
          Conv2d-520           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-521           [-1, 2064, 8, 8]           4,128
            SiLU-522           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-523           [-1, 2064, 1, 1]               0
          Conv2d-524             [-1, 86, 1, 1]         177,590
            SiLU-525             [-1, 86, 1, 1]               0
          Conv2d-526           [-1, 2064, 1, 1]         179,568
         Sigmoid-527           [-1, 2064, 1, 1]               0
SqueezeExcitation-528           [-1, 2064, 8, 8]               0
          Conv2d-529            [-1, 344, 8, 8]         710,016
     BatchNorm2d-530            [-1, 344, 8, 8]             688
 StochasticDepth-531            [-1, 344, 8, 8]               0
          MBConv-532            [-1, 344, 8, 8]               0
          Conv2d-533           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-534           [-1, 2064, 8, 8]           4,128
            SiLU-535           [-1, 2064, 8, 8]               0
          Conv2d-536           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-537           [-1, 2064, 8, 8]           4,128
            SiLU-538           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-539           [-1, 2064, 1, 1]               0
          Conv2d-540             [-1, 86, 1, 1]         177,590
            SiLU-541             [-1, 86, 1, 1]               0
          Conv2d-542           [-1, 2064, 1, 1]         179,568
         Sigmoid-543           [-1, 2064, 1, 1]               0
SqueezeExcitation-544           [-1, 2064, 8, 8]               0
          Conv2d-545            [-1, 344, 8, 8]         710,016
     BatchNorm2d-546            [-1, 344, 8, 8]             688
 StochasticDepth-547            [-1, 344, 8, 8]               0
          MBConv-548            [-1, 344, 8, 8]               0
          Conv2d-549           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-550           [-1, 2064, 8, 8]           4,128
            SiLU-551           [-1, 2064, 8, 8]               0
          Conv2d-552           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-553           [-1, 2064, 8, 8]           4,128
            SiLU-554           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-555           [-1, 2064, 1, 1]               0
          Conv2d-556             [-1, 86, 1, 1]         177,590
            SiLU-557             [-1, 86, 1, 1]               0
          Conv2d-558           [-1, 2064, 1, 1]         179,568
         Sigmoid-559           [-1, 2064, 1, 1]               0
SqueezeExcitation-560           [-1, 2064, 8, 8]               0
          Conv2d-561            [-1, 344, 8, 8]         710,016
     BatchNorm2d-562            [-1, 344, 8, 8]             688
 StochasticDepth-563            [-1, 344, 8, 8]               0
          MBConv-564            [-1, 344, 8, 8]               0
          Conv2d-565           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-566           [-1, 2064, 8, 8]           4,128
            SiLU-567           [-1, 2064, 8, 8]               0
          Conv2d-568           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-569           [-1, 2064, 8, 8]           4,128
            SiLU-570           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-571           [-1, 2064, 1, 1]               0
          Conv2d-572             [-1, 86, 1, 1]         177,590
            SiLU-573             [-1, 86, 1, 1]               0
          Conv2d-574           [-1, 2064, 1, 1]         179,568
         Sigmoid-575           [-1, 2064, 1, 1]               0
SqueezeExcitation-576           [-1, 2064, 8, 8]               0
          Conv2d-577            [-1, 344, 8, 8]         710,016
     BatchNorm2d-578            [-1, 344, 8, 8]             688
 StochasticDepth-579            [-1, 344, 8, 8]               0
          MBConv-580            [-1, 344, 8, 8]               0
          Conv2d-581           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-582           [-1, 2064, 8, 8]           4,128
            SiLU-583           [-1, 2064, 8, 8]               0
          Conv2d-584           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-585           [-1, 2064, 8, 8]           4,128
            SiLU-586           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-587           [-1, 2064, 1, 1]               0
          Conv2d-588             [-1, 86, 1, 1]         177,590
            SiLU-589             [-1, 86, 1, 1]               0
          Conv2d-590           [-1, 2064, 1, 1]         179,568
         Sigmoid-591           [-1, 2064, 1, 1]               0
SqueezeExcitation-592           [-1, 2064, 8, 8]               0
          Conv2d-593            [-1, 344, 8, 8]         710,016
     BatchNorm2d-594            [-1, 344, 8, 8]             688
 StochasticDepth-595            [-1, 344, 8, 8]               0
          MBConv-596            [-1, 344, 8, 8]               0
          Conv2d-597           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-598           [-1, 2064, 8, 8]           4,128
            SiLU-599           [-1, 2064, 8, 8]               0
          Conv2d-600           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-601           [-1, 2064, 8, 8]           4,128
            SiLU-602           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-603           [-1, 2064, 1, 1]               0
          Conv2d-604             [-1, 86, 1, 1]         177,590
            SiLU-605             [-1, 86, 1, 1]               0
          Conv2d-606           [-1, 2064, 1, 1]         179,568
         Sigmoid-607           [-1, 2064, 1, 1]               0
SqueezeExcitation-608           [-1, 2064, 8, 8]               0
          Conv2d-609            [-1, 344, 8, 8]         710,016
     BatchNorm2d-610            [-1, 344, 8, 8]             688
 StochasticDepth-611            [-1, 344, 8, 8]               0
          MBConv-612            [-1, 344, 8, 8]               0
          Conv2d-613           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-614           [-1, 2064, 8, 8]           4,128
            SiLU-615           [-1, 2064, 8, 8]               0
          Conv2d-616           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-617           [-1, 2064, 8, 8]           4,128
            SiLU-618           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-619           [-1, 2064, 1, 1]               0
          Conv2d-620             [-1, 86, 1, 1]         177,590
            SiLU-621             [-1, 86, 1, 1]               0
          Conv2d-622           [-1, 2064, 1, 1]         179,568
         Sigmoid-623           [-1, 2064, 1, 1]               0
SqueezeExcitation-624           [-1, 2064, 8, 8]               0
          Conv2d-625            [-1, 344, 8, 8]         710,016
     BatchNorm2d-626            [-1, 344, 8, 8]             688
 StochasticDepth-627            [-1, 344, 8, 8]               0
          MBConv-628            [-1, 344, 8, 8]               0
          Conv2d-629           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-630           [-1, 2064, 8, 8]           4,128
            SiLU-631           [-1, 2064, 8, 8]               0
          Conv2d-632           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-633           [-1, 2064, 8, 8]           4,128
            SiLU-634           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-635           [-1, 2064, 1, 1]               0
          Conv2d-636             [-1, 86, 1, 1]         177,590
            SiLU-637             [-1, 86, 1, 1]               0
          Conv2d-638           [-1, 2064, 1, 1]         179,568
         Sigmoid-639           [-1, 2064, 1, 1]               0
SqueezeExcitation-640           [-1, 2064, 8, 8]               0
          Conv2d-641            [-1, 344, 8, 8]         710,016
     BatchNorm2d-642            [-1, 344, 8, 8]             688
 StochasticDepth-643            [-1, 344, 8, 8]               0
          MBConv-644            [-1, 344, 8, 8]               0
          Conv2d-645           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-646           [-1, 2064, 8, 8]           4,128
            SiLU-647           [-1, 2064, 8, 8]               0
          Conv2d-648           [-1, 2064, 8, 8]          51,600
     BatchNorm2d-649           [-1, 2064, 8, 8]           4,128
            SiLU-650           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-651           [-1, 2064, 1, 1]               0
          Conv2d-652             [-1, 86, 1, 1]         177,590
            SiLU-653             [-1, 86, 1, 1]               0
          Conv2d-654           [-1, 2064, 1, 1]         179,568
         Sigmoid-655           [-1, 2064, 1, 1]               0
SqueezeExcitation-656           [-1, 2064, 8, 8]               0
          Conv2d-657            [-1, 344, 8, 8]         710,016
     BatchNorm2d-658            [-1, 344, 8, 8]             688
 StochasticDepth-659            [-1, 344, 8, 8]               0
          MBConv-660            [-1, 344, 8, 8]               0
          Conv2d-661           [-1, 2064, 8, 8]         710,016
     BatchNorm2d-662           [-1, 2064, 8, 8]           4,128
            SiLU-663           [-1, 2064, 8, 8]               0
          Conv2d-664           [-1, 2064, 8, 8]          18,576
     BatchNorm2d-665           [-1, 2064, 8, 8]           4,128
            SiLU-666           [-1, 2064, 8, 8]               0
AdaptiveAvgPool2d-667           [-1, 2064, 1, 1]               0
          Conv2d-668             [-1, 86, 1, 1]         177,590
            SiLU-669             [-1, 86, 1, 1]               0
          Conv2d-670           [-1, 2064, 1, 1]         179,568
         Sigmoid-671           [-1, 2064, 1, 1]               0
SqueezeExcitation-672           [-1, 2064, 8, 8]               0
          Conv2d-673            [-1, 576, 8, 8]       1,188,864
     BatchNorm2d-674            [-1, 576, 8, 8]           1,152
          MBConv-675            [-1, 576, 8, 8]               0
          Conv2d-676           [-1, 3456, 8, 8]       1,990,656
     BatchNorm2d-677           [-1, 3456, 8, 8]           6,912
            SiLU-678           [-1, 3456, 8, 8]               0
          Conv2d-679           [-1, 3456, 8, 8]          31,104
     BatchNorm2d-680           [-1, 3456, 8, 8]           6,912
            SiLU-681           [-1, 3456, 8, 8]               0
AdaptiveAvgPool2d-682           [-1, 3456, 1, 1]               0
          Conv2d-683            [-1, 144, 1, 1]         497,808
            SiLU-684            [-1, 144, 1, 1]               0
          Conv2d-685           [-1, 3456, 1, 1]         501,120
         Sigmoid-686           [-1, 3456, 1, 1]               0
SqueezeExcitation-687           [-1, 3456, 8, 8]               0
          Conv2d-688            [-1, 576, 8, 8]       1,990,656
     BatchNorm2d-689            [-1, 576, 8, 8]           1,152
 StochasticDepth-690            [-1, 576, 8, 8]               0
          MBConv-691            [-1, 576, 8, 8]               0
          Conv2d-692           [-1, 3456, 8, 8]       1,990,656
     BatchNorm2d-693           [-1, 3456, 8, 8]           6,912
            SiLU-694           [-1, 3456, 8, 8]               0
          Conv2d-695           [-1, 3456, 8, 8]          31,104
     BatchNorm2d-696           [-1, 3456, 8, 8]           6,912
            SiLU-697           [-1, 3456, 8, 8]               0
AdaptiveAvgPool2d-698           [-1, 3456, 1, 1]               0
          Conv2d-699            [-1, 144, 1, 1]         497,808
            SiLU-700            [-1, 144, 1, 1]               0
          Conv2d-701           [-1, 3456, 1, 1]         501,120
         Sigmoid-702           [-1, 3456, 1, 1]               0
SqueezeExcitation-703           [-1, 3456, 8, 8]               0
          Conv2d-704            [-1, 576, 8, 8]       1,990,656
     BatchNorm2d-705            [-1, 576, 8, 8]           1,152
 StochasticDepth-706            [-1, 576, 8, 8]               0
          MBConv-707            [-1, 576, 8, 8]               0
          Conv2d-708           [-1, 2304, 8, 8]       1,327,104
     BatchNorm2d-709           [-1, 2304, 8, 8]           4,608
            SiLU-710           [-1, 2304, 8, 8]               0
AdaptiveAvgPool2d-711           [-1, 2304, 1, 1]               0
         Dropout-712                 [-1, 2304]               0
          Linear-713                 [-1, 1000]       2,305,000
================================================================
Total params: 43,040,704
Trainable params: 43,040,704
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 1042.51
Params size (MB): 164.19
Estimated Total Size (MB): 1207.45
----------------------------------------------------------------
